<template>
	<view class="content">
		<view>
			1.此应用【钉钉打卡助手】仅限用于定时打开钉钉，非定位修改软件，使用时请确保已打开钉钉极速打卡且设备在打卡范围之内。
		</view>
		<view>
			2.【首次跳转】部分设备第一次跳转至钉钉时需要点击“允许”才可以正常使用定时跳转功能。
		</view>
		<view>
			3.请设置“打卡起始时间”与“打卡结束时间”，【钉钉打卡助手】将在此时间段内生成随机的时间：“下次打卡时间”，并在“下次打卡时间”到来的时候跳转至钉钉。
		</view>
		<view>
			4.请设置“星期”，默认为每天，“下次打卡时间”受“打卡起始时间”、“打卡结束时间”与“星期”三者共同制约，“下次打卡时间”的生成规则为在“打卡起始时间”与“打卡结束时间”之间，且在“星期”之间。
		</view>
		<view>
			5.【钉钉打卡助手】会自动保持屏幕常亮，您无需更改系统设置，若要正常跳转至钉钉，请务必保持【钉钉打卡助手】始终在前台且电量充足，切勿锁屏！。
		</view>
		<view>
			6.开发者不对使用此应用造成的任何后果负责，也无法保证应用一定不会出现跳转不了的情况，同样也无法保证应用无BUG，因此请不要讲：
			【这个需求很简单】，
			【怎么实现我不管】，
			【哪种语言你随便】，
			【不服可以找老板】。
			【明天上线】
		</view>
		<view>
			7.此应用是免费的，请勿用于任何商业用途.
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

			};
		}
	}
</script>

<style lang="scss" scoped>
	.content {
		padding: 20rpx;

		view {
			font-size: 28rpx;
			font-weight: bold;
		}
	}
</style>
